export default [
  {
    title: 'Git 에 대하여',
    robot: 'Git 에 대하여 Git 사용법을 알아야 한다. git은 필수다. 라는 말을 수도없이 들어왔고 나도 한번 써본 이후로 편리해 계속 쓰게되었다. 사용한지 얼마 되진않은 뉴비이기에 잘못된점은 말씀해주시면 감사하겠습니다. Git 탄생배경 리누스 토발즈가 리눅스 커널을 개발에 이용하려고 개발했다고 한다. 그래서 Git 이 뭐죠? Git 은 소스 코드 관리를 위한 분산버전관리 시스템 이다. Git 의 작업폴더는 소스코드 수정기록과 그 기록을 볼 수 있는 로컬저장소(Local Repository) 이다.',
    route: 'posts/1',
  },
  {
    title: 'Git 기초 첫번째',
    robot: 'Git 기초 첫번째 목차 Git의 특징 Git 기본 사용법 수정하고 저장소에 저장하기 수정하고 저장소에 저장하기 파일의 상태 확인하기 파일을 새로 추적하기 Modified 상태의 파일을 Stage 하기 파일 무시하기 Staged 와 Unstaged 상태의 변경내용을 보기 변경사항 커밋하기 Staging Area 생략하기 파일을 삭제하기 파일 이름 변경하기 마치며 Git 의 특징 1. 스냅샷 Git의 데이터는 파일시스템의 스냅이며 크기가 아주 작다.',
    route: 'posts/2',
  },
];
