export default [
  {
    title: 'Vuetiful Korea 4회 를 다녀오며',
    robot: 'Vuetiful Korea 4회 를 다녀오며 2018년 4월 17일에 해당 밋업을 다녀왔다. 밋업에 살짝 늦게되어 첫번째 발표는 듣지 못했다. 발표순서는 다음과 같았다. 아뇨, 난 Vue.js 사용할건데요? 새로운 패러다임, 이전 코드의 문제점, vue.js 를 도입하기전 신경써야하는 부분, 실제 서비스에 적용해본 vue.js, 느낀점 Vue.js와 Electron으로 데스크탑 앱 만들기',
    route: 'posts/1',
  },
  {
    title: 'LINE 2018 SW개발 하계인턴 - 정규직 채용 연계형 지원하다',
    robot: 'LINE 2018 SW개발 하계인턴 - 정규직 채용 연계형 지원하다 기대 대학 생활 하면서 인턴쉽 생활을 꼭 해보고싶었는데 마침 좋은 기회가 있어서 지원을 해봤다. 솔직히 말하면 개발자의 길로 가고싶다는 생각을 갖고 실천한게 얼마 되지 않았다. 한 반년? 길다면 길지만 정말 쉬지않고 달렸기때문에 나의 실력을 테스트해보고싶었던 순간이었다.',
    route: 'posts/2',
  },
  {
    title: '2018 SW개발 하계인턴 - 정규직 채용 연계형 코딩테스트 후기 및 느낀점',
    robot: '2018 SW개발 하계인턴 - 정규직 채용 연계형 코딩테스트 후기 및 느낀점 코딩테스트 망했다... 서류전형에서 합격은 했지만 코딩테스트에서 떨어졌다... 느낀점 필기도 생각보다 많이 어려웠다 여러가지 유형의 필기문제들이 많았다. 좀 더 기본적인 것들을 배워야겠다. 일단 알고리즘을 많이 풀어봐야할것같고 문법에도 익숙해져야겠다 일단 백준 알고리즘을 많이 풀어봐야할것같고 문법에도 익숙해져야겠다 알고리즘에도 많은 종류가 있는데 종류별로 매일매일 풀어보는게 좋을것같다 기본적인 문자열 다루기에 힘좀 써야겠다.',
    route: 'posts/3',
  },
  {
    title: 'DevFest Seoul 2018 을 다녀오며',
    robot: 'DevFest Seoul 2018 을 다녀오며 과거의 나 처음에 인터넷을 하다가 DevFest 가 개최한다는것을 보았다.컨퍼런스에 참여하기 앞서 드는 생각은 대학생인 나로써 과연 저 세션들을 이해할 수 있을까? 라는 것이다. 물론 대학생이라는것은 핑계인것 같고 내가 듣고 이해할 수 있는 능력이 되는가? 가 관건이었다. 2018년 1월에 처음 웹개발에 발을 들어서면서 친구의 권유로 vuetiful korea4 를 가게되었는데 이때는 경험삼아 가본것이었고, 되게 신기했다. 나와는 다른세상 같았다.',
    route: 'posts/4',
  },
  {
    title: 'Chrome Devtools를 활용한 성능측정과 개선 - 한재엽님',
    robot: 'Chrome Devtools를 활용한 성능측정과 개선 - 한재엽님 성능이란 UX다 무조건 빠른게 아니라 사용자에게 끊기는 느낌이 없도록 부드럽게 보여져야한다. 측정할 수 없다면 개선할 수 없다. 한재엽님이 생각하는 주관적인 성능에대한 짤막한 글이었습니다. 어떻게 측정할것인가? 어떻게 측정할 것인가에대해 RAIL 모델을 기반한다고 말씀하셨습니다. RAIL 모델이란? 사용자 중심 성능 모델로 요약할 수 있는데 RAIL 은 다음을 축약한 단어이다.',
    route: 'posts/5',
  },
  {
    title: '실전 SPA상태관리 톺아보기 - 김동우님',
    robot: '실전 SPA상태관리 톺아보기 - 김동우님 SPA란 싱글 페이지 어플리케이션(Single Page Application) 의 약자로 전체 페이지를 새로 로드하는 대신 동적으로 현재 페이지를 다시 작성하여 사용자와 상호작용하는 웹 응용 프로그램 또는 웹 사이트 SPA 는 View Library 가 필요하다 Angular : google React : Facebook Vue : Evan You 다음은 라이브러리 및 프레임워크의 공통점 이다. 선언적 렌더링 virtual DOM 컴포넌트 기반 김동우 님은 React 를 더 좋아하시어 React 의 상태관리툴들을 살펴봅니다.',
    route: 'posts/6',
  },
  {
    title: '모던 브라우저는 어떻게 동작하는가 ? - 방진호님',
    robot: '모던 브라우저는 어떻게 동작하는가 ? - 방진호님 Chromium 이란? 크롬 브라우저의 오픈소스 소스코드만 13GB 이고 iMAC 5K 기준 빌드시간만 3시간이라고 하심 ㄷ ㄷ 내부 동작을 알아서 뭐하나? 브라우저 및 웹 플랫폼 개발에 참여할 수 있다. 웹 표준 개발에 참여 프론트엔드 개발시 성능 향상에 도움이 됨 다양한 소프트웨어 개발 분야에 활용될 수 있음. Chromium은 Multi-Process Architecture 이다.',
    route: 'posts/7',
  },
  {
    title: '2018년 회고',
    robot: '2018년 회고 한 해가 마무리 되어가고 있기에 내 자신을 되돌아보는 차원에서 회고를 하려고한다. 개발자에 대한 꿈을 갖고 1월부터 달려온 \'나\' 이기에 얼마나 성장했는지 무얼 했는지 학업 잘 마무리했는지 꿈은 변함이 없는지 주로 네가지 관점으로 회고하려고 한다. 내가 존경하는 빈지노의 Always Awake 를 들으면서 써야겠다',
    route: 'posts/8',
  },
];
